SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_vdac.h
/**************************************************************************//**
 * @file
 * @brief EFR32SG23 VDAC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32SG23_VDAC_H
#define EFR32SG23_VDAC_H

#define VDAC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32SG23_VDAC VDAC
 * @{
 * @brief EFR32SG23 VDAC Register Declaration.
 *****************************************************************************/

/** VDAC Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< Module Enable                                      */
  __IOM uint32_t             SWRST;                  /**< Software Reset Register                            */
  __IOM uint32_t             CFG;                    /**< Config Register                                    */
  __IM  uint32_t             STATUS;                 /**< Status Register                                    */
  __IOM uint32_t             CH0CFG;                 /**< Channel 0 Config Register                          */
  __IOM uint32_t             CH1CFG;                 /**< Channel 1 Config Register                          */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IOM uint32_t             CH0F;                   /**< Channel 0 Data Write Fifo                          */
  __IOM uint32_t             CH1F;                   /**< Channel 1 Data Write Fifo                          */
  __IOM uint32_t             OUTCTRL;                /**< DAC Output Control                                 */
  __IOM uint32_t             OUTTIMERCFG;            /**< DAC Out Timer Config Register                      */
        uint32_t             RESERVED0[50U];    /**< Reserved for future use                            */
        uint32_t             RESERVED1[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED2[63U];    /**< Reserved for future use                            */
        uint32_t             RESERVED3[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED4[895U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< Module Enable                                      */
  __IOM uint32_t             SWRST_SET;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_SET;                /**< Config Register                                    */
  __IM  uint32_t             STATUS_SET;             /**< Status Register                                    */
  __IOM uint32_t             CH0CFG_SET;             /**< Channel 0 Config Register                          */
  __IOM uint32_t             CH1CFG_SET;             /**< Channel 1 Config Register                          */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             CH0F_SET;               /**< Channel 0 Data Write Fifo                          */
  __IOM uint32_t             CH1F_SET;               /**< Channel 1 Data Write Fifo                          */
  __IOM uint32_t             OUTCTRL_SET;            /**< DAC Output Control                                 */
  __IOM uint32_t             OUTTIMERCFG_SET;        /**< DAC Out Timer Config Register                      */
        uint32_t             RESERVED5[50U];    /**< Reserved for future use                            */
        uint32_t             RESERVED6[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED7[63U];    /**< Reserved for future use                            */
        uint32_t             RESERVED8[1U];          /**< Reserved for future use                            */
        uint32_t             RESERVED9[895U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< Module Enable                                      */
  __IOM uint32_t             SWRST_CLR;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_CLR;                /**< Config Register                                    */
  __IM  uint32_t             STATUS_CLR;             /**< Status Register                                    */
  __IOM uint32_t             CH0CFG_CLR;             /**< Channel 0 Config Register                          */
  __IOM uint32_t             CH1CFG_CLR;             /**< Channel 1 Config Register                          */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             CH0F_CLR;               /**< Channel 0 Data Write Fifo                          */
  __IOM uint32_t             CH1F_CLR;               /**< Channel 1 Data Write Fifo                          */
  __IOM uint32_t             OUTCTRL_CLR;            /**< DAC Output Control                                 */
  __IOM uint32_t             OUTTIMERCFG_CLR;        /**< DAC Out Timer Config Register                      */
        uint32_t             RESERVED10[50U];   /**< Reserved for future use                            */
        uint32_t             RESERVED11[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED12[63U];   /**< Reserved for future use                            */
        uint32_t             RESERVED13[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED14[895U];  /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< Module Enable                                      */
  __IOM uint32_t             SWRST_TGL;              /**< Software Reset Register                            */
  __IOM uint32_t             CFG_TGL;                /**< Config Register                                    */
  __IM  uint32_t             STATUS_TGL;             /**< Status Register                                    */
  __IOM uint32_t             CH0CFG_TGL;             /**< Channel 0 Config Register                          */
  __IOM uint32_t             CH1CFG_TGL;             /**< Channel 1 Config Register                          */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             CH0F_TGL;               /**< Channel 0 Data Write Fifo                          */
  __IOM uint32_t             CH1F_TGL;               /**< Channel 1 Data Write Fifo                          */
  __IOM uint32_t             OUTCTRL_TGL;            /**< DAC Output Control                                 */
  __IOM uint32_t             OUTTIMERCFG_TGL;        /**< DAC Out Timer Config Register                      */
        uint32_t             RESERVED15[50U];   /**< Reserved for future use                            */
        uint32_t             RESERVED16[1U];         /**< Reserved for future use                            */
        uint32_t             RESERVED17[63U];   /**< Reserved for future use                            */
        uint32_t             RESERVED18[1U];         /**< Reserved for future use                            */
} VDAC_TypeDef;
/** @} End of group EFR32SG23_VDAC */

/**************************************************************************//**
 * @addtogroup EFR32SG23_VDAC
 * @{
 * @defgroup EFR32SG23_VDAC_BitFields VDAC Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for VDAC IPVERSION */
#define _VDAC_IPVERSION_RESETVALUE              0x00000001UL                            /**< Default value for VDAC_IPVERSION            */
#define _VDAC_IPVERSION_MASK                    0xFFFFFFFFUL                            /**< Mask for VDAC_IPVERSION                     */
#define _VDAC_IPVERSION_IPVERSION_SHIFT         0                                       /**< Shift value for VDAC_IPVERSION              */
#define _VDAC_IPVERSION_IPVERSION_MASK          0xFFFFFFFFUL                            /**< Bit mask for VDAC_IPVERSION                 */
#define _VDAC_IPVERSION_IPVERSION_DEFAULT       0x00000001UL                            /**< Mode DEFAULT for VDAC_IPVERSION             */
#define VDAC_IPVERSION_IPVERSION_DEFAULT        (_VDAC_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for VDAC_IPVERSION     */

/* Bit fields for VDAC EN */
#define _VDAC_EN_RESETVALUE                     0x00000000UL                            /**< Default value for VDAC_EN                   */
#define _VDAC_EN_MASK                           0x00000003UL                            /**< Mask for VDAC_EN                            */
#define VDAC_EN_EN                              (0x1UL << 0)                            /**< VDAC Module Enable                          */
#define _VDAC_EN_EN_SHIFT                       0                                       /**< Shift value for VDAC_EN                     */
#define _VDAC_EN_EN_MASK                        0x1UL                                   /**< Bit mask for VDAC_EN                        */
#define _VDAC_EN_EN_DEFAULT                     0x00000000UL                            /**< Mode DEFAULT for VDAC_EN                    */
#define _VDAC_EN_EN_DISABLE                     0x00000000UL                            /**< Mode DISABLE for VDAC_EN                    */
#define _VDAC_EN_EN_ENABLE                      0x00000001UL                            /**< Mode ENABLE for VDAC_EN                     */
#define VDAC_EN_EN_DEFAULT                      (_VDAC_EN_EN_DEFAULT << 0)              /**< Shifted mode DEFAULT for VDAC_EN            */
#define VDAC_EN_EN_DISABLE                      (_VDAC_EN_EN_DISABLE << 0)              /**< Shifted mode DISABLE for VDAC_EN            */
#define VDAC_EN_EN_ENABLE                       (_VDAC_EN_EN_ENABLE << 0)               /**< Shifted mode ENABLE for VDAC_EN             */
#define VDAC_EN_DISABLING                       (0x1UL << 1)                            /**< Disablement busy status                     */
#define _VDAC_EN_DISABLING_SHIFT                1                                       /**< Shift value for VDAC_DISABLING              */
#define _VDAC_EN_DISABLING_MASK                 0x2UL                                   /**< Bit mask for VDAC_DISABLING                 */
#define _VDAC_EN_DISABLING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for VDAC_EN                    */
#define VDAC_EN_DISABLING_DEFAULT               (_VDAC_EN_DISABLING_DEFAULT << 1)       /**< Shifted mode DEFAULT for VDAC_EN            */

/* Bit fields for VDAC SWRST */
#define _VDAC_SWRST_RESETVALUE                  0x00000000UL                            /**< Default value for VDAC_SWRST                */
#define _VDAC_SWRST_MASK                        0x00000003UL                            /**< Mask for VDAC_SWRST                         */
#define VDAC_SWRST_SWRST                        (0x1UL << 0)                            /**< Software reset command                      */
#define _VDAC_SWRST_SWRST_SHIFT                 0                                       /**< Shift value for VDAC_SWRST                  */
#define _VDAC_SWRST_SWRST_MASK                  0x1UL                                   /**< Bit mask for VDAC_SWRST                     */
#define _VDAC_SWRST_SWRST_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for VDAC_SWRST                 */
#define VDAC_SWRST_SWRST_DEFAULT                (_VDAC_SWRST_SWRST_DEFAULT << 0)        /**< Shifted mode DEFAULT for VDAC_SWRST         */
#define VDAC_SWRST_RESETTING                    (0x1UL << 1)                            /**< Software reset busy status                  */
#define _VDAC_SWRST_RESETTING_SHIFT             1                                       /**< Shift value for VDAC_RESETTING              */
#define _VDAC_SWRST_RESETTING_MASK              0x2UL                                   /**< Bit mask for VDAC_RESETTING                 */
#define _VDAC_SWRST_RESETTING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for VDAC_SWRST                 */
#define VDAC_SWRST_RESETTING_DEFAULT            (_VDAC_SWRST_RESETTING_DEFAULT << 1)    /**< Shifted mode DEFAULT for VDAC_SWRST         */

